Documentation update. Tox update. tetsing schedules added.
